# Homework 2

#### Due Sunday 3rd of December 2017 - 23:55

In [60]:
%reload_ext sql
%sql postgresql://h11729352:h11729352@dbs.ai.wu.ac.at

'Connected: h11729352@None'

The following relations are used in this homework:

> Customers (_cid_ **INTEGER** **PRIMARY** **KEY**, _name_ **VARCHAR** **NOT** _**NULL**_, _dob_ **DATE**)  

> Orders (_cid_ **INTEGER** **NOT** _**NULL**_, _bid_ **INTEGER** **NOT** _**NULL**_, _price_ **REAL**)

Note the absence of keys in the Orders table.

> Books (_bid_ **INTEGER** **PRIMARY** **KEY**, _title_ **VARCHAR**, _author_ **VARCHAR**)

Basic operators are the 7 basic relational algebra operators (or their SQL counterparts) from slide 68 of Lecture 1.

In [37]:
%%sql

DROP TABLE IF EXISTS Customer CASCADE;
CREATE TABLE Customer(cid INTEGER PRIMARY KEY, name VARCHAR NOT NULL, dob DATE);

DROP TABLE IF EXISTS Orders CASCADE;
CREATE TABLE Orders(cid INTEGER NOT NULL, bid INTEGER NOT NULL, price REAL);

DROP TABLE IF EXISTS Book CASCADE;
CREATE TABLE Book(bid INTEGER PRIMARY KEY, title VARCHAR, author VARCHAR);

DROP TABLE IF EXISTS Fiction CASCADE;
CREATE TABLE Fiction(bid INTEGER PRIMARY KEY, FOREIGN KEY (bid) REFERENCES Book(bid));

Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [38]:
%%sql

TRUNCATE TABLE Book CASCADE;
INSERT INTO Book VALUES(1, 'The Black Swan', 'Nassim Taleb'), (2, 'Fooled by Randomness', 'Nassim Taleb'), (3, 'Ethics', 'Aristoteles' ), (4, 'Harry Potter and the Philosopher''s stone', 'Joan Roaling' ), (5, 'Hobbit', 'J.R.R. Tolkien' );

TRUNCATE TABLE Fiction CASCADE;
INSERT INTO Fiction Values(4), (5);

TRUNCATE TABLE Customer CASCADE;
INSERT INTO Customer VALUES (1, 'George Clooney', '1961-05-06'), (2, 'Angelina Jolie', '1975-06-04'), (3, 'Brad Pitt', '1963-12-18'), (4, 'Tom Cruise', '1963-07-03');

TRUNCATE TABLE Orders CASCADE;
INSERT INTO Orders values(1, 1, 36), (1, 2, 26), (2, 3, 26), (2, 4, 16.6), (3, 4, 16.3), (3, 5, 21.63), (3, 5, 16.3), (3, 4, 21.63), (4, 1, 33.2), (25, 5, 1.1);

Done.
5 rows affected.
Done.
2 rows affected.
Done.
4 rows affected.
Done.
10 rows affected.

[]

### Exercise 1

#### a) Simulate the LEFT and FULL OUTER JOINs between Customers and Orders using the basic SQL operators.

> Note that SQL allows arbitrary computed columns, including constants in the SELECT clause:

>> **SELECT** _cid_, _name_, _**NULL**_::**INTEGER**, 1, _‘some string’_::**VARCHAR** **FROM** Customers;

> The _“::type”_ construct allows to specify the data type of computed columns.

In [61]:
%%sql
--LEFT Join simulation
select * from customer JOIN orders ON customer.cid=orders.cid
UNION
SELECT cid,name,dob,  NULL as cid, NULL as bid, NULL as price FROM customer 
WHERE customer.cid NOT IN (SELECT cid FROM orders);

11 rows affected.

[(3, 'Brad Pitt', datetime.date(1963, 12, 18), 3, 4, 21.63),
 (3, 'Brad Pitt', datetime.date(1963, 12, 18), 3, 4, 16.3),
 (3, 'Brad Pitt', datetime.date(1963, 12, 18), 3, 5, 21.63),
 (32, 'TEST2', datetime.date(1999, 2, 12), None, None, None),
 (3, 'Brad Pitt', datetime.date(1963, 12, 18), 3, 5, 16.3),
 (2, 'Angelina Jolie', datetime.date(1975, 6, 4), 2, 4, 16.6),
 (1, 'George Clooney', datetime.date(1961, 5, 6), 1, 2, 26.0),
 (2, 'Angelina Jolie', datetime.date(1975, 6, 4), 2, 3, 26.0),
 (4, 'Tom Cruise', datetime.date(1963, 7, 3), 4, 1, 33.2),
 (23, 'TEST1', datetime.date(1961, 5, 6), None, None, None),
 (1, 'George Clooney', datetime.date(1961, 5, 6), 1, 1, 36.0)]

In [62]:
%%sql
--Full outer join simulation

SELECT * from customer JOIN orders ON customer.cid=orders.cid
UNION
SELECT cid,name,dob,  NULL as cid, NULL as bid, NULL as price FROM customer 
WHERE customer.cid NOT IN (SELECT cid FROM orders)
UNION
SELECT NULL as cid, NULL as name, NULL as dob, cid,bid, price FROM orders
WHERE orders.cid NOT IN (SELECT cid FROM customer);

14 rows affected.

[(3, 'Brad Pitt', datetime.date(1963, 12, 18), 3, 4, 21.63),
 (3, 'Brad Pitt', datetime.date(1963, 12, 18), 3, 4, 16.3),
 (3, 'Brad Pitt', datetime.date(1963, 12, 18), 3, 5, 21.63),
 (32, 'TEST2', datetime.date(1999, 2, 12), None, None, None),
 (3, 'Brad Pitt', datetime.date(1963, 12, 18), 3, 5, 16.3),
 (2, 'Angelina Jolie', datetime.date(1975, 6, 4), 2, 4, 16.6),
 (None, None, None, 21, 1, 12.2),
 (1, 'George Clooney', datetime.date(1961, 5, 6), 1, 2, 26.0),
 (None, None, None, 25, 5, 1.1),
 (2, 'Angelina Jolie', datetime.date(1975, 6, 4), 2, 3, 26.0),
 (4, 'Tom Cruise', datetime.date(1963, 7, 3), 4, 1, 33.2),
 (23, 'TEST1', datetime.date(1961, 5, 6), None, None, None),
 (1, 'George Clooney', datetime.date(1961, 5, 6), 1, 1, 36.0),
 (None, None, None, 16, 2, 30.0)]

#### b) Specify small instances of the relations Customers and Orders above that show the differences between the operators.

In [ ]:
The order of the elements is different using the different methods. The join 1st selects all the results from the first table,
matches the second table and then shows the results that are left unmatched. The Union goes through the 1st table and 
shows the results as ordered there no matter if the cid matches or not and then through the second table.

#### c) Test your queries on the data from (b) in PostgresSQL!

In [63]:
%%sql
select * from customer left join orders on customer.cid=orders.cid

11 rows affected.

[(1, 'George Clooney', datetime.date(1961, 5, 6), 1, 1, 36.0),
 (1, 'George Clooney', datetime.date(1961, 5, 6), 1, 2, 26.0),
 (2, 'Angelina Jolie', datetime.date(1975, 6, 4), 2, 3, 26.0),
 (2, 'Angelina Jolie', datetime.date(1975, 6, 4), 2, 4, 16.6),
 (3, 'Brad Pitt', datetime.date(1963, 12, 18), 3, 4, 16.3),
 (3, 'Brad Pitt', datetime.date(1963, 12, 18), 3, 5, 21.63),
 (3, 'Brad Pitt', datetime.date(1963, 12, 18), 3, 5, 16.3),
 (3, 'Brad Pitt', datetime.date(1963, 12, 18), 3, 4, 21.63),
 (4, 'Tom Cruise', datetime.date(1963, 7, 3), 4, 1, 33.2),
 (32, 'TEST2', datetime.date(1999, 2, 12), None, None, None),
 (23, 'TEST1', datetime.date(1961, 5, 6), None, None, None)]

### Exercise 2 - Translate into SQL

#### a) Select the names of the authors with the highest number of book orders.

In [64]:
%%sql

SELECT author FROM book INNER JOIN orders ON book.bid = orders.bid GROUP BY book.author ORDER BY COUNT(orders.bid) DESC;

4 rows affected.

[('Nassim Taleb',), ('J.R.R. Tolkien',), ('Joan Roaling',), ('Aristoteles',)]

#### b) Add number of orders and an average book price to each author name.

In [65]:
%%sql
SELECT author, avg (price) AS avg, count(orders.bid) AS sum from book 
INNER JOIN orders ON orders.bid = book.bid group by author order by avg (price), count(orders.bid);

4 rows affected.

[('J.R.R. Tolkien', 13.0099994738897, 3),
 ('Joan Roaling', 18.1766662597656, 3),
 ('Aristoteles', 26.0, 1),
 ('Nassim Taleb', 27.4800001144409, 5)]

#### c) Keep only those authors whose books have generated more than 20’000 in revenues.

In [66]:
%%sql
--I've put the threshold on 50, because they all have less than 20000 in revenues:

SELECT author, sum (price) AS sum FROM book INNER JOIN orders ON orders.bid=book.bid GROUP BY author HAVING SUM(price)>50;

2 rows affected.

[('Joan Roaling', 54.53), ('Nassim Taleb', 137.4)]

### Exercise 3 - Implement the following queries on the dvdrental database from Homework 1 using SQL

In [67]:
%%sql
postgresql://h11729352:h11729352@dbs.ai.wu.ac.at/dvdrental

'Connected: h11729352@dvdrental'

#### a) Find staff members who rented more than 10 film titles in English.

In [68]:
%%sql
-- This one shows that both the staff members have rented more than 10 movies in english.

with temp as (
SELECT DISTINCT film.title, staff.staff_id FROM staff INNER JOIN rental ON staff.staff_id = rental.staff_id 
INNER JOIN inventory ON inventory.inventory_id=rental.inventory_id INNER JOIN film ON film.film_id=inventory.film_id 
INNER JOIN language ON film.language_id = language.language_id WHERE language.language_id=1)

SELECT staff_id, COUNT(title) FROM temp group by staff_id HAVING COUNT(title)>10;

2 rows affected.

[(1, 956), (2, 956)]

#### b) What is the maximum number of English titles rented by a single staff member?

In [69]:
%%sql

with temp as (
SELECT DISTINCT film.title, staff.staff_id FROM staff INNER JOIN rental ON staff.staff_id = rental.staff_id 
INNER JOIN inventory ON inventory.inventory_id=rental.inventory_id INNER JOIN film ON film.film_id=inventory.film_id 
INNER JOIN language ON film.language_id = language.language_id WHERE language.language_id=1)

SELECT staff_id, COUNT(title) FROM temp group by staff_id ORDER BY COUNT (title) desc  LIMIT 1;

1 rows affected.

[(1, 956)]

#### c) Number of English titles rented by all stuff members?

In [70]:
%%sql
with temp as (
SELECT DISTINCT film.title, staff.staff_id FROM staff INNER JOIN rental ON staff.staff_id = rental.staff_id 
INNER JOIN inventory ON inventory.inventory_id=rental.inventory_id INNER JOIN film ON film.film_id=inventory.film_id 
INNER JOIN language ON film.language_id = language.language_id WHERE language.language_id=1)

SELECT temp.staff_id, COUNT(title) FROM temp 
INNER JOIN staff ON staff.staff_id=temp.staff_id AND staff.staff_id<>temp.staff_id GROUP BY temp.staff_id;

0 rows affected.

[]

#### d) Are there French titles that gave more than 100 EUR in rental revenues?

In [71]:
%%sql
-- There are no french movies, therefore I have selected the English titles and have included the 
--number of times they have been rented in the output:
    
WITH temp AS(
	SELECT DISTINCT  title, amount, rental.rental_id FROM film 
    INNER JOIN inventory ON inventory.film_id=film.film_id 
    INNER JOIN rental ON rental.inventory_id=inventory.inventory_id
    INNER JOIN payment ON payment.rental_id=rental.rental_id
    INNER JOIN language ON film.language_id=language.language_id
    AND language.language_id=1
	)
SELECT title, SUM(amount), COUNT(rental_id) FROM temp  GROUP BY title HAVING SUM(amount)>100 ORDER BY SUM(amount) DESC;

173 rows affected.

[('Telegraph Voyage', Decimal('215.75'), 25),
 ('Zorro Ark', Decimal('199.72'), 28),
 ('Wife Turn', Decimal('198.73'), 27),
 ('Innocent Usual', Decimal('191.74'), 26),
 ('Hustler Party', Decimal('190.78'), 22),
 ('Saturday Lambs', Decimal('190.74'), 26),
 ('Titans Jerk', Decimal('186.73'), 27),
 ('Harry Idaho', Decimal('177.73'), 27),
 ('Torque Bound', Decimal('169.76'), 23),
 ('Dogma Family', Decimal('168.72'), 28),
 ('Pelican Comforts', Decimal('165.77'), 23),
 ('Goodfellas Salute', Decimal('164.75'), 25),
 ('Fool Mockingbird', Decimal('162.79'), 21),
 ('Apache Divine', Decimal('160.72'), 28),
 ('Enemy Odds', Decimal('159.75'), 25),
 ('Cat Coneheads', Decimal('159.73'), 27),
 ('Scorpion Apollo', Decimal('158.79'), 21),
 ('Range Moonwalker', Decimal('158.77'), 23),
 ('Scalawag Duck', Decimal('157.71'), 29),
 ('Sunrise League', Decimal('155.78'), 22),
 ('Lola Agent', Decimal('154.77'), 23),
 ('Maiden Home', Decimal('152.78'), 22),
 ('Velvet Terminator', Decimal('152.77'), 23),
 ('Closer Bang', Decimal('152.76'), 24),
 ('Bucket Brotherhood', Decimal('150.72'), 28),
 ('Sting Personal', Decimal('149.80'), 20),
 ('Titanic Boondock', Decimal('149.78'), 22),
 ('Massacre Usual', Decimal('149.75'), 25),
 ('Nightmare Chill', Decimal('148.79'), 21),
 ('Videotape Arsenic', Decimal('148.76'), 24),
 ('American Circus', Decimal('146.81'), 19),
 ('Witches Panic', Decimal('146.75'), 25),
 ('Show Lord', Decimal('145.78'), 22),
 ('Minds Truman', Decimal('144.81'), 19),
 ('Working Microcosmos', Decimal('144.78'), 22),
 ('Head Stranger', Decimal('142.79'), 21),
 ('Wonderland Christmas', Decimal('142.79'), 21),
 ('Whisperer Giant', Decimal('141.80'), 20),
 ('Forrester Comancheros', Decimal('141.74'), 26),
 ('Backlash Undefeated', Decimal('140.84'), 16),
 ('Dorado Notting', Decimal('140.78'), 22),
 ('Boogie Amelie', Decimal('140.74'), 25),
 ('Secrets Paradise', Decimal('139.82'), 18),
 ('Mine Titans', Decimal('138.83'), 17),
 ('Pity Bound', Decimal('138.77'), 23),
 ('Stagecoach Armageddon', Decimal('138.77'), 23),
 ('Streetcar Intentions', Decimal('137.77'), 23),
 ('Roses Treasure', Decimal('137.77'), 23),
 ('Fellowship Autumn', Decimal('137.76'), 24),
 ('Steel Santa', Decimal('136.78'), 22),
 ('Confidential Interview', Decimal('136.76'), 24),
 ('Trip Newton', Decimal('135.74'), 26),
 ('Flintstones Happiness', Decimal('134.83'), 17),
 ('Garden Island', Decimal('134.82'), 18),
 ('Suit Walls', Decimal('134.81'), 19),
 ('Eagles Panky', Decimal('134.81'), 19),
 ('Flamingos Connecticut', Decimal('134.78'), 22),
 ('Attraction Newton', Decimal('133.78'), 22),
 ('Trading Pinocchio', Decimal('133.77'), 23),
 ('Easy Gladiator', Decimal('132.80'), 20),
 ('Heartbreakers Bright', Decimal('132.80'), 20),
 ('Durham Panky', Decimal('132.76'), 24),
 ('Moonshine Cabin', Decimal('131.80'), 20),
 ('Name Detective', Decimal('131.78'), 22),
 ('Drifter Commandments', Decimal('131.78'), 22),
 ('Aladdin Calendar', Decimal('131.77'), 23),
 ('Lies Treatment', Decimal('131.76'), 24),
 ('Coneheads Smoochy', Decimal('131.76'), 24),
 ('Midsummer Groundhog', Decimal('129.82'), 18),
 ('Details Packer', Decimal('128.82'), 18),
 ('Queen Luke', Decimal('128.79'), 21),
 ('Tourist Pelican', Decimal('126.81'), 19),
 ('Liaisons Sweet', Decimal('126.79'), 21),
 ('Kiss Glory', Decimal('126.79'), 21),
 ('Sabrina Midnight', Decimal('126.79'), 21),
 ('Seattle Expecations', Decimal('125.80'), 19),
 ('Beauty Grease', Decimal('125.79'), 21),
 ('Movie Shakespeare', Decimal('125.78'), 23),
 ('Gleaming Jawbreaker', Decimal('125.72'), 27),
 ('Chance Resurrection', Decimal('124.76'), 24),
 ('Calendar Gunfight', Decimal('123.82'), 18),
 ('Heavyweights Beast', Decimal('123.78'), 22),
 ('Satisfaction Confidential', Decimal('122.84'), 16),
 ('Yentl Idaho', Decimal('122.79'), 21),
 ('Coma Head', Decimal('122.77'), 23),
 ('Center Dinosaur', Decimal('121.79'), 21),
 ('Sleeping Suspects', Decimal('121.78'), 22),
 ('Princess Giant', Decimal('121.77'), 24),
 ('Pulp Beverly', Decimal('121.74'), 26),
 ('Kissing Dolls', Decimal('120.83'), 17),
 ('Dawn Pond', Decimal('120.83'), 17),
 ('Something Duck', Decimal('120.82'), 18),
 ('Trap Guys', Decimal('119.85'), 15),
 ('Pinocchio Simon', Decimal('119.82'), 18),
 ('Rage Games', Decimal('119.81'), 19),
 ('Bingo Talented', Decimal('119.75'), 25),
 ('Doors President', Decimal('118.82'), 18),
 ('Desert Poseidon', Decimal('118.81'), 19),
 ('Maltese Hope', Decimal('118.79'), 21),
 ('Suspects Quills', Decimal('118.73'), 27),
 ('Fidelity Devil', Decimal('117.82'), 18),
 ('Snatch Slipper', Decimal('117.80'), 20),
 ('High Encino', Decimal('117.79'), 21),
 ('Waterfront Deliverance', Decimal('116.84'), 16),
 ('Metropolis Coma', Decimal('116.76'), 24),
 ('Network Peak', Decimal('116.73'), 27),
 ('Road Roxanne', Decimal('115.83'), 17),
 ('Hunchback Impossible', Decimal('115.83'), 17),
 ('Beverly Outlaw', Decimal('115.79'), 21),
 ('Freddy Storm', Decimal('115.79'), 21),
 ('Conversation Downhill', Decimal('114.83'), 17),
 ('Cause Date', Decimal('114.81'), 19),
 ('Whale Bikini', Decimal('113.85'), 15),
 ('Lady Stage', Decimal('113.84'), 16),
 ('Redemption Comforts', Decimal('113.80'), 20),
 ('Strictly Scarface', Decimal('113.77'), 23),
 ('Secretary Rouge', Decimal('112.82'), 18),
 ('Agent Truman', Decimal('111.81'), 19),
 ('Candles Grapes', Decimal('111.80'), 20),
 ('Money Harold', Decimal('111.80'), 20),
 ('Mission Zoolander', Decimal('110.84'), 16),
 ('Interview Liaisons', Decimal('110.82'), 18),
 ('Prejudice Oleander', Decimal('110.81'), 19),
 ('Ridgemont Submarine', Decimal('110.72'), 28),
 ('Teen Apollo', Decimal('109.86'), 14),
 ('Shawshank Bubble', Decimal('109.81'), 19),
 ('Arachnophobia Rollercoaster', Decimal('109.77'), 23),
 ('Horn Working', Decimal('109.77'), 23),
 ('Butterfly Chocolat', Decimal('108.74'), 26),
 ('Command Darling', Decimal('107.84'), 16),
 ('Ghost Groundhog', Decimal('107.81'), 19),
 ('Philadelphia Wife', Decimal('107.80'), 21),
 ('Scarface Bang', Decimal('106.84'), 16),
 ('Brooklyn Desert', Decimal('106.81'), 19),
 ('Falcon Volume', Decimal('106.81'), 18),
 ('Spice Sorority', Decimal('106.81'), 19),
 ('Virtual Spoilers', Decimal('105.87'), 13),
 ('Galaxy Sweethearts', Decimal('105.84'), 16),
 ('League Hellfighters', Decimal('105.83'), 17),
 ('Chasing Fight', Decimal('105.82'), 19),
 ('Requiem Tycoon', Decimal('105.82'), 18),
 ('Driving Polish', Decimal('105.81'), 19),
 ('Reign Gentlemen', Decimal('105.81'), 19),
 ('Secret Groundhog', Decimal('105.81'), 19),
 ('Clueless Bucket', Decimal('105.77'), 23),
 ('Strangers Graffiti', Decimal('104.86'), 14),
 ('Breakfast Goldfinger', Decimal('104.84'), 16),
 ('Jerk Paycheck', Decimal('104.81'), 19),
 ('Truman Crazy', Decimal('104.80'), 20),
 ('Wash Heavenly', Decimal('104.80'), 20),
 ('Arizona Bang', Decimal('104.79'), 21),
 ('Hanky October', Decimal('104.77'), 23),
 ('Tycoon Gathering', Decimal('103.88'), 12),
 ('Million Ace', Decimal('103.83'), 17),
 ('Sleepless Monsoon', Decimal('103.83'), 17),
 ('Open African', Decimal('103.81'), 19),
 ('Angels Life', Decimal('103.80'), 20),
 ('Cupboard Sinners', Decimal('103.78'), 22),
 ('Greatest North', Decimal('103.73'), 27),
 ('Birds Perdition', Decimal('102.83'), 17),
 ('Undefeated Dalmations', Decimal('102.81'), 19),
 ('South Wait', Decimal('102.79'), 21),
 ('Timberland Sky', Decimal('102.74'), 26),
 ('Forward Temple', Decimal('102.74'), 26),
 ('Paycheck Wait', Decimal('101.84'), 16),
 ('Attacks Hate', Decimal('101.84'), 16),
 ('Expecations Natural', Decimal('101.83'), 17),
 ('Sweden Shining', Decimal('101.83'), 16),
 ('Samurai Lion', Decimal('101.76'), 24),
 ('Tomorrow Hustler', Decimal('101.76'), 24),
 ('Poseidon Forever', Decimal('100.83'), 17),
 ('Giant Troopers', Decimal('100.74'), 26),
 ('Invasion Cyclone', Decimal('100.74'), 26)]

#### e) What are the 3 most popular Italian movies?

In [72]:
%%sql
--There are no italian movies in the DB, so I have presented the top 3 English movies here:
    
WITH temp AS(
	SELECT DISTINCT rental.rental_id, title FROM film 
    INNER JOIN inventory ON inventory.film_id=film.film_id 
    INNER JOIN rental ON rental.inventory_id=inventory.inventory_id
    INNER JOIN language ON film.language_id=language.language_id
    AND language.language_id=1
	)
SELECT title, COUNT(rental_id) FROM temp GROUP BY title ORDER BY COUNT(rental_id) DESC LIMIT 3;

3 rows affected.

[('Bucket Brotherhood', 34), ('Rocketeer Mother', 33), ('Scalawag Duck', 32)]

### Exercise 4

#### a) Assume that the PK column oid in the Orders table, and the following additional table are added to the schema

>> **CREATE** **TABLE** Payments (_pid_ **INTEGER**, _oid_ **INTEGER**, _payment_day_ **DATE**);

> which indicates when an order has been paid, and the following query:

>> **SELECT** _oid_ **FROM** Orders **WHERE** _oid_ **NOT** **IN** (**SELECT** _oid_ **FROM** Payments)

> Would this be a good query for checking unpaid orders? (Consider that the oid column in payments could contain nulls). Explain possible problems the query above can lead to.

It would be a good query, if it didn't include null values in it. The NOT IN statement includes nulls, therefore it will not be suitable for the occasion and orders may appear which are with null values in payments.oid field. We better use inner join or EXISTS subquery here:

select orders.oid from orders inner join payments on payments.oid = orders.oid;

SELECT oid FROM Orders WHERE EXISTS (SELECT * FROM Payments WHERE payments.oid=orders.oid )

#### b) What could be an intuitive meaning of the following query

> **SELECT** _oid_ **FROM** Orders  
**EXCEPT**  
**SELECT** _oid_ **FROM** Orders **WHERE** _oid_ **NOT** **IN** (**SELECT** _oid_ **FROM** Payments)

This one will select all the oids for the orders, but will EXCLUDE the oids that match the oids from Payments table. The result will include the nulls, because the second query returns TRUE only if it has found a match and is excluding the nulls in it.

#### c) With the following small instance

>**INSERT** **INTO** Customers **VALUES** (3, _'Bob'_, _**NULL**_);  
**INSERT** **INTO** Books **VALUES** (1, _'Black Swan'_, _'Taleb'_);  
**INSERT** **INTO** Orders **VALUES** (10, 3, 1, 25);  
**INSERT** **INTO** Payments **VALUES** (101, _**NULL**_, _'2017-04-05'_);  

>Explain the output that PostgreSQL produces for the query above on this instance. Is it an expected
output for the query explanation from (b)?

Again nothing will change, we insert tuple with blank oid field in the Payments table, therefore we will know that we have received a payment, but not for which order. The output for the query from (b) again won't include this payment.

### Exercise 5

>Write down a command for creating a btree-index on customers' first names in the
**dvdrental** database and give an example for a range query using that index (index-only scan)
providing the respective 'explain' command.

>(Note that the command will not work in the **dvdrental** database, which is read-only. You have to
create a similar table in you own db to execute such a query).

In [ ]:
%%sql
CREATE INDEX fname_idx ON customer USING btree (first_name);

In [ ]:
%%sql
--Here is the query I have used on my local DB, which looks for a name which start with a or b;

--   EXPLAIN SELECT first_name FROM customer WHERE first_name BETWEEN 'a' AND 'c';

--Here is the result of the explain query. The db decided that it will be faster to use the index in order to show the results:

--'Index Only Scan using fname_idx on customer  (cost=0.28..5.90 rows=81 width=6)'
--'  Index Cond: ((first_name >= 'a'::text) AND (first_name <= 'c'::text))'

--Unfortunately, sometimes(i have tried with a LIKE statement) it doesn't use the index that I have created 
--and is using the non-indexed first_name field instead. 
--Maybe it thinks that the data isn't enough and it will take more time to search using index.:

### Exercise 6

> Look at the indexes defined in the dvdrental database

> (**SELECT** `*` **FROM** _pg&#95;indexes_ **WHERE** _schemaname_=_'public'_ **OR** use the \di command in psql) and
group them according to the purpose these indexes should serve (e.g., making joining tables more
efficient, ensuring constraints, filtering rows for specific WHERE clauses…).

> Write down your own
query that involves a join and uses one of the indexes. Which join method do you see executed most
often?

In [ ]:
There are three different categories of indexes in the dvdrental database. 

One of the groups is the indexes for the primary keys.Each table has a primary key and a corresponding UNIQUE INDEX. 
In some of the tables (i.e. film_category) the primary key index is combined from two different columns. Primary key is always
an index, because we usually refer to it as a unique identifier and have to be easier to be found when searching for it.

The other group I can see is the foreign key index group. Usually the foreign keys are also indexed for easier referencing of the
table, except if the selectivity is too low. 

Another group is made of custom made UNIQUE indexes for example - 'idx_unq_rental_rental_date_inventory_id_customer_id' - which 
is created in order to search between the mentioned tables faster and to have unique rental date for a inventory id and a cust id.

One more custom created group is indexing of the names in which category is the index we created in excercise 5 as well. Similar 
to it is the index of the actor.last_name field. These types of indexes are helping the query optimizer to find the required 
match in the corresponding table faster by searching by the name. We assume that there will be many of these searches and that is
why these indexes are made.

In [32]:
%%sql
--We can see that usually the Hash-join method is used, and when there is a where clause, the results are filtered using the
--index created.

EXPLAIN SELECT * FROM rental INNER JOIN payment ON payment.rental_id=rental.rental_id WHERE rental.rental_id BETWEEN 10 AND 20;

5 rows affected.

[('Nested Loop  (cost=0.57..87.64 rows=9 width=62)',),
 ('  ->  Index Scan using rental_pkey on rental  (cost=0.29..8.51 rows=10 width=36)',),
 ('        Index Cond: ((rental_id >= 10) AND (rental_id <= 20))',),
 ('  ->  Index Scan using idx_fk_rental_id on payment  (cost=0.29..7.90 rows=1 width=26)',),
 ('        Index Cond: (rental_id = rental.rental_id)',)]

In [33]:
%%sql
--again hash join

EXPLAIN SELECT * FROM inventory INNER JOIN rental ON inventory.inventory_id=rental.inventory_id;

5 rows affected.

[('Hash Join  (cost=128.07..659.12 rows=16044 width=52)',),
 ('  Hash Cond: (rental.inventory_id = inventory.inventory_id)',),
 ('  ->  Seq Scan on rental  (cost=0.00..310.44 rows=16044 width=36)',),
 ('  ->  Hash  (cost=70.81..70.81 rows=4581 width=16)',),
 ('        ->  Seq Scan on inventory  (cost=0.00..70.81 rows=4581 width=16)',)]

### Exercise 7

> The following query is executed by PostgreSQL using the sort merge join algorithm:

> **SELECT** `*` **FROM**  

>>(**SELECT** _last&#95;name_, _first&#95;name_, _actor&#95;id_ **FROM** actor **ORDER** **BY** _last&#95;name_) **A**  

>**NATURAL** **JOIN**  

>>(**SELECT** _last&#95;name_, _first&#95;name_, _customer&#95;id_ **FROM** customer **ORDER** **BY** _last&#95;name_) **C**

#### a) Analyze the above query in PostgreSQL using the EXPLAIN command and copy the output.

In [ ]:
%%sql
explain SELECT * FROM
(SELECT last_name, first_name, actor_id FROM actor ORDER BY last_name) A
NATURAL JOIN
(SELECT last_name, first_name, customer_id FROM customer ORDER BY last_name) C;
                                QUERY PLAN
--------------------------------------------------------------------------
 Merge Join  (cost=54.34..69.21 rows=1 width=21)
   Merge Cond: ((customer.last_name)::text = (actor.last_name)::text)
   Join Filter: ((actor.first_name)::text = (customer.first_name)::text)
   ->  Sort  (cost=42.62..44.12 rows=599 width=17)
         Sort Key: customer.last_name
         ->  Seq Scan on customer  (cost=0.00..14.99 rows=599 width=17)
   ->  Materialize  (cost=11.64..14.64 rows=200 width=17)
         ->  Sort  (cost=11.64..12.14 rows=200 width=17)
               Sort Key: actor.last_name
               ->  Seq Scan on actor  (cost=0.00..4.00 rows=200 width=17)

--Here is used Merge Join method, which means that both sides of the join must be sorted by the join predicates.
--It is almost like the hash join but there is one aspect that is unique to the sort-merge join: absolute symmetry
--The join order does not make any difference—not even for performance. This property is very useful for outer joins. 
--First the join is defined, with the attributes that have to match, then we see the scan of the 1st table returns 599 rows
--the scan of the second table returns 200 rows .

#### b) What changes if you add DESC at the end of the first subquery (A)? Which join method is used now? Explain.

In [12]:
%%sql
explain SELECT * FROM
(SELECT last_name, first_name, actor_id FROM actor ORDER BY last_name DESC) A
NATURAL JOIN
(SELECT last_name, first_name, customer_id FROM customer ORDER BY last_name) C

10 rows affected.

[('Hash Join  (cost=70.74..74.75 rows=1 width=21)',),
 ('  Hash Cond: (((actor.last_name)::text = (c.last_name)::text) AND ((actor.first_name)::text = (c.first_name)::text))',),
 ('  ->  Sort  (cost=11.64..12.14 rows=200 width=17)',),
 ('        Sort Key: actor.last_name DESC',),
 ('        ->  Seq Scan on actor  (cost=0.00..4.00 rows=200 width=17)',),
 ('  ->  Hash  (cost=50.11..50.11 rows=599 width=17)',),
 ('        ->  Subquery Scan on c  (cost=42.62..50.11 rows=599 width=17)',),
 ('              ->  Sort  (cost=42.62..44.12 rows=599 width=17)',),
 ('                    Sort Key: customer.last_name',),
 ('                    ->  Seq Scan on customer  (cost=0.00..14.99 rows=599 width=17)',)]

In [ ]:
-- Here the Hash Join method is used, as we decided ot switch to descending order. Here first the outer table is scanned and
then the inner table, only where matches are found. It is the better method in this case. We can also see that the order
of the queries executed is different, here the query for A desc is done second instead of first.

#### c) The sort merge join is very seldom used. Can you guess why? What is the main disadvantage of this algorithm?

In [ ]:
The sort-merge join performs very well once the inputs are sorted, it is hardly used because sorting both sides is very expensive. 
The hash join, on the other hand, needs to preprocess only one side and then join only with the matching rows from the other table